In [63]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Описание данных
Этот набор данных содержит информацию о невыплаченных платежах, демографических факторах, кредитных данных, историй платежей и выписки по счетам клиентов кредитных карт на Тайване с апреля 2005 года по сентябрь 2005 года.

## Описание полей

* ID - идентификатор клиента;
* LIMIT_BAL - сумма предоставленного кредита в новых тайваньских долларах (включая индивидуальный и семейный/дополнительный кредит);
* SEX - пол (1 - мужской, 2 - женский);
* EDUCATION - образование (1 - аспирантура, 2 - университет, 3 - средняя школа, 4 - другое, 5 - неизвестно, 6 - неизвестно);
* MARRIAGE - информация о браке (1 - женат/замужем, 2 - холост/не замужем, 3 - другое);
* AGE - возраст (в годах);
* PAY_0 - статус погашения в сентябре 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* PAY_2 - статус погашения в август 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* PAY_3 - статус погашения в июль 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* PAY_4 - статус погашения в июнь 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* PAY_5 - статус погашения в май 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* PAY_6 - статус погашения в апреле 2005 г. (-1 - оплата своевременно, 1 - задержка платежа на один месяц, 2 - задержка платежа на два месяца, ..., 8 - задержка платежа на восемь месяцев, 9 - задержка платежа на девять месяцев и более);
* BILL_AMT1 - сумма выписки по счету в сентябре 2005 г. (в новых тайваньских долларах);
* BILL_AMT2 - сумма выписки по счету в августе 2005 г. (в новых тайваньских долларах);
* BILL_AMT3 - сумма выписки по счету в июле 2005 г. (в новых тайваньских долларах);
* BILL_AMT4 - сумма выписки по счету в июне 2005 г. (в новых тайваньских долларах);
* BILL_AMT5 - сумма выписки по счету в мае 2005 г. (в новых тайваньских долларах);
* BILL_AMT6 - сумма выписки по счету в апреле 2005 г. (в новых тайваньских долларах);
* PAY_AMT1 - сумма предыдущего платежа в сентябре 2005 г. (в новых тайваньских долларах);
* PAY_AMT2 - сумма предыдущего платежа в августе 2005 г. (в новых тайваньских долларах);
* PAY_AMT3 - сумма предыдущего платежа в июле 2005 г. (в новых тайваньских долларах);
* PAY_AMT4 - сумма предыдущего платежа в июне 2005 г. (в новых тайваньских долларах);
* PAY_AMT5 - сумма предыдущего платежа в мае 2005 г. (в новых тайваньских долларах);
* PAY_AMT6 - сумма предыдущего платежа в апреле 2005 г. (в новых тайваньских долларах);
* default.payment.next.month - дефолт (1 - да, 0 - нет).

In [64]:
# Чтение данных из CSV файла
data = pd.read_csv('data/UCI_Credit_Card.csv')

In [65]:
display(data.head())

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0

In [66]:
# Для удобства переименуем столбец 'default.payment.next.month' в 'default'
data.rename(columns={'default.payment.next.month': 'default'}, inplace=True)

# А также все столбцы в нижний регистр
data.columns = [col.lower() for col in data.columns]

In [67]:
# Посмотрим на распределение целевой переменной
data["default"].value_counts(dropna=False)

default
0    23364
1     6636
Name: count, dtype: int64

In [68]:
# Посмотрим на основные статистики по демографическим данным (пол)
display(data["sex"].value_counts(dropna=False))

sex
2    18112
1    11888
Name: count, dtype: int64

In [69]:
# Посмотрим на основные статистики по демографическим данным (образование)
display(data["education"].value_counts(dropna=False))

education
2    14030
1    10585
3     4917
5      280
4      123
6       51
0       14
Name: count, dtype: int64

In [70]:
# В выборке содержатся неявные пропуски в образовании (0 - неизвестно, 5 - другое, 6 - неизвестно)
# Объединим их в одну категорию 5
data["education"].replace({0: 5, 6: 5}, inplace=True)
display(data["education"].value_counts(dropna=False))

education
2    14030
1    10585
3     4917
5      345
4      123
Name: count, dtype: int64

In [72]:
# Посмотрим на основные статистики по демографическим данным (информация о браке)
display(data["marriage"].value_counts(dropna=False))

marriage
2    15964
1    13659
3      323
0       54
Name: count, dtype: int64

In [73]:
# В выборке также содержится неявные пропуски в семейном положении (0 - неизвестно)
# Объединим их в одну категорию 3
data["marriage"].replace({0: 3}, inplace=True)
display(data["marriage"].value_counts(dropna=False))

marriage
2    15964
1    13659
3      377
Name: count, dtype: int64

In [76]:
# Посмотрим на основные статистики по демографическим данным (возраст)
display(data["age"].describe(percentiles=[0.01, 0.05, 0.1, 0.25, 0.5, 0.75, 0.9, 0.95, 0.99]))

count    30000.000000
mean        35.485500
std          9.217904
min         21.000000
1%          22.000000
5%          23.000000
10%         25.000000
25%         28.000000
50%         34.000000
75%         41.000000
90%         49.000000
95%         53.000000
99%         60.000000
max         79.000000
Name: age, dtype: float64

In [80]:
# Посмотрим на статистики по финансовым данным
display(data.loc[:, "pay_0":"pay_6"].describe())

,pay_0,pay_2,pay_3,pay_4,pay_5,pay_6
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100
std,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988
min,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000
25%,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000
50%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000

In [84]:
display(data["pay_0"].value_counts(dropna=False).sort_index())

pay_0
-2     2759
-1     5686
 0    14737
 1     3688
 2     2667
 3      322
 4       76
 5       26
 6       11
 7        9
 8       19
Name: count, dtype: int64

In [ ]:
# Для всех платежей мы видим нехарактерные значения статусов -2 и 0, которых не должно быть
# Посмотрим на них подробнее и попробуем понять, что они означают
# Для начала посмотрим на статус -2
display(data.loc[data["pay_0"] == -2, "bill_amt1":].head())
display(data.loc[data["pay_0"] == -2, "pay_0":"pay_6"].head())

,bill_amt1,bill_amt2,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6,default
9,0.0,0.0,0.0,0.0,13007.0,13912.0,0.0,0.0,0.0,13007.0,1122.0,0.0,0
23,5512.0,19420.0,1473.0,560.0,0.0,0.0,19428.0,1473.0,560.0,0.0,0.0,1128.0,1
33,10929.0,4152.0,22722.0,7521.0,71439.0,8981.0,4152.0,22827.0,7521.0,71439.0,981.0,51582.0,0
34,13709.0,5006.0,31130.0,3180.0,0.0,5293.0,5006.0,31178.0,3180.0,0.0,5293.0,768.0,0
45,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1

    pay_0  pay_2  pay_3  pay_4  pay_5  pay_6
9      -2     -2     -2     -2     -1     -1
23     -2     -2     -2     -2     -2     -2
33     -2     -2     -2     -2     -2     -2
34     -2     -2     -2     -2     -2     -2
45     -2     -2     -2     -2     -2     -2

In [88]:
# Вероятно, что -2 означает, что клиент не имел задолженностей в этот месяц
# Посмотрим подробнее на статус 0
display(data.loc[data["pay_0"] == 0, "bill_amt1":].head())
display(data.loc[data["pay_0"] == 0, "pay_0":"pay_6"].head())

,bill_amt1,bill_amt2,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6,default
2,29239.0,14027.0,13559.0,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,46990.0,48233.0,49291.0,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
5,64400.0,57069.0,57608.0,19394.0,19619.0,20024.0,2500.0,1815.0,657.0,1000.0,1000.0,800.0,0
6,367965.0,412023.0,445007.0,542653.0,483003.0,473944.0,55000.0,40000.0,38000.0,20239.0,13750.0,13770.0,0
7,11876.0,380.0,601.0,221.0,-159.0,567.0,380.0,601.0,0.0,581.0,1687.0,1542.0,0

   pay_0  pay_2  pay_3  pay_4  pay_5  pay_6
2      0      0      0      0      0      0
3      0      0      0      0      0      0
5      0      0      0      0      0      0
6      0      0      0      0      0      0
7      0     -1     -1      0      0     -1